import { LocaleInterface } from './locale.interface';

export const LocaleRu: LocaleInterface = {
  page: {
    about: 'О проекте',
    contact: 'Контакты',
    contributing: 'Помощь проекту',
    devblog: 'Разработка',
    download: 'Загрузки',
    faq: 'FAQ',
    home: 'Главная',
    links: 'Полезные ссылки',
    media: 'Медиа',
    servers: 'Серверы',
  },
  authorize: {
    recoverAccount: {
      desc_Title: 'С возвращением!',
      desc: 'Здесь вы можете найти информацию об игровых режимах, игровых серверах, игроках, статистике и многое другое!',
      page_Title: 'Восстановление аккаунта',
      page_Hint: 'Введите логин и мы отправим инструкцию по восстановлению учетной записи на ваш электронный адрес.',
      userName: 'Логин',
      recover: 'Восстановить',
      signIn: 'Вспомнили пароль?',
    },
    signIn: {
      desc_Title: 'С возвращением!',
      desc: 'Здесь вы можете найти информацию об игровых режимах, игровых серверах, игроках, статистике и многое другое!',
      page_Title: 'Авторизация',
      signUp: 'Создать учетную запись',
      signUp_Hint_1: 'Нет учетной записи?',
      signUp_Hint_2: 'Это займет всего пару минут.',
      userName: 'Логин',
      password: 'Пароль',
      signIn: 'Войти',
      recoverAccount: 'Забыли пароль от учетной записи?',
    },
    signUp: {
      desc_Title: 'Добро пожаловать!',
      desc: 'Здесь вы можете найти информацию об игровых режимах, игровых серверах, игроках, статистике и многое другое!',
      page_Title: 'Регистрация',
      signIn: 'Авторизоваться',
      signIn_Hint: 'Уже есть учетная запись?',
      userName: 'Логин',
      password: 'Пароль',
      signUp: 'Зарегистрировать',
    },
  },
  locale: {
    us: 'Английский',
    ru: 'Русский',
  },
};
